# WallSweepCutByInsertsParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallSweepCutByInsertsParam Property
ParameterTypeId Class See Also
---
"Cut by Inserts"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallSweepCutByInsertsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallSweepCutByInsertsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallSweepCutByInsertsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace